scrapper/load-test/results/report-client-side-caching/statistics.json
{
  "GET /links" : {
    "transaction" : "GET /links",
    "sampleCount" : 28774,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.540036143740757,
    "medianResTime" : 17.0,
    "minResTime" : 8.0,
    "maxResTime" : 230.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 35.0,
    "throughput" : 105.90473947080756,
    "receivedKBytesPerSec" : 700.6192466642528,
    "sentKBytesPerSec" : 14.26116167550617
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 86343,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 54.04335035845437,
    "medianResTime" : 13.0,
    "minResTime" : 6.0,
    "maxResTime" : 48875.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 30.0,
    "throughput" : 269.2253725339794,
    "receivedKBytesPerSec" : 637.173382353629,
    "sentKBytesPerSec" : 55.56375678574658
  },
  "POST /links" : {
    "transaction" : "POST /links",
    "sampleCount" : 28790,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 98.09030913511647,
    "medianResTime" : 12.0,
    "minResTime" : 6.0,
    "maxResTime" : 48868.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 32.0,
    "throughput" : 89.76985366796691,
    "receivedKBytesPerSec" : 21.816616173072784,
    "sentKBytesPerSec" : 21.657529562430426
  },
  "DELETE /links" : {
    "transaction" : "DELETE /links",
    "sampleCount" : 28779,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 46.4765280239063,
    "medianResTime" : 13.0,
    "minResTime" : 6.0,
    "maxResTime" : 48875.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 30.0,
    "throughput" : 90.14593624412292,
    "receivedKBytesPerSec" : 21.908621997445564,
    "sentKBytesPerSec" : 21.924320460870668
  }
}