scrapper/load-test/results/report-no-cache/statistics.json
{
  "GET /links" : {
    "transaction" : "GET /links",
    "sampleCount" : 16037,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.817671634345519,
    "medianResTime" : 13.0,
    "minResTime" : 7.0,
    "maxResTime" : 65.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 31.0,
    "throughput" : 56.595650071816515,
    "receivedKBytesPerSec" : 374.56558699635804,
    "sentKBytesPerSec" : 7.4000127046417825
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 48135,
    "errorCount" : 8,
    "errorPct" : 0.016619923,
    "meanResTime" : 102.95049340396871,
    "medianResTime" : 11.0,
    "minResTime" : 5.0,
    "maxResTime" : 43084.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 25.0,
    "throughput" : 148.43150133676235,
    "receivedKBytesPerSec" : 351.53254884309155,
    "sentKBytesPerSec" : 30.054727201996048
  },
  "POST /links" : {
    "transaction" : "POST /links",
    "sampleCount" : 16053,
    "errorCount" : 4,
    "errorPct" : 0.024917461,
    "meanResTime" : 178.11630224879997,
    "medianResTime" : 10.0,
    "minResTime" : 5.0,
    "maxResTime" : 43084.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 30.459999999999127,
    "throughput" : 49.50183631368123,
    "receivedKBytesPerSec" : 12.138671483520973,
    "sentKBytesPerSec" : 11.748948089832897
  },
  "DELETE /links" : {
    "transaction" : "DELETE /links",
    "sampleCount" : 16045,
    "errorCount" : 4,
    "errorPct" : 0.024929885,
    "meanResTime" : 116.8355874104083,
    "medianResTime" : 10.0,
    "minResTime" : 5.0,
    "maxResTime" : 43078.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 30.0,
    "throughput" : 49.51060258214224,
    "receivedKBytesPerSec" : 12.111816466518242,
    "sentKBytesPerSec" : 11.847751160428855
  }
}