scrapper/load-test/results/report-redis/statistics.json
{
  "GET /links" : {
    "transaction" : "GET /links",
    "sampleCount" : 116430,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.45094906810954,
    "medianResTime" : 13.0,
    "minResTime" : 6.0,
    "maxResTime" : 271.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 48.0,
    "throughput" : 389.9614158248707,
    "receivedKBytesPerSec" : 2579.8359468676317,
    "sentKBytesPerSec" : 52.512443249946415
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 349304,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.901947873485478,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 1260.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 24.0,
    "throughput" : 1164.6184109625578,
    "receivedKBytesPerSec" : 2756.8215949606993,
    "sentKBytesPerSec" : 240.35466673994765
  },
  "POST /links" : {
    "transaction" : "POST /links",
    "sampleCount" : 116440,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.530118515974067,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 1260.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 38.0,
    "throughput" : 388.2407466065612,
    "receivedKBytesPerSec" : 94.35656104438895,
    "sentKBytesPerSec" : 93.66770835243585
  },
  "DELETE /links" : {
    "transaction" : "DELETE /links",
    "sampleCount" : 116434,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.72493429754205,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 222.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 36.0,
    "throughput" : 389.8572949661486,
    "receivedKBytesPerSec" : 94.75020014008497,
    "sentKBytesPerSec" : 94.81916423844329
  }
}